{
  "id": "post_52",
  "title": "Smoked Thanksgiving Turkey",
  "wordpress_url": "https://recipes.ihathaway.com/main-course/elementor-52/",
  "content": "Michelle doesn't like turkey very much. She's not super picky about food, so she'll eat it. She just doesn't think it tastes like much and isn't worth the time and effort. This recipe, she likes.\n\nWe've been cooking our Thanksgiving turkeys this way for so long that I forget where I learned this method. I know I used to do this before I moved out of my parents home, so that means it's been over 20 years of turkeys this way.\n\nThis turkey comes out smelling awesome. The taste is a little tangy, a little piney, and a lot smokey. While your holiday table will smell wonderful. The flavors become more pronounced after refrigerating for a day. Those leftover turkey sandwiches for Friday... they'll be amazing.\n\nYou can't cook this in an oven, so you'll need either a charcoal grill or a smoker to do this. Also, I absolutely insist on using an instant-read meat thermometer. I don't like the leave-it-in style, and temperature is the only way to know when meat is safe to eat. (That is, unless you cook it for 20 hours at 200F like we do the brisket, but that's another story)\n\n<!--WPRM Recipe 50-->\n<div class=\"wprm-fallback-recipe\">\n\t<h2 class=\"wprm-fallback-recipe-name\">Smoked Thanksgiving Turkey</h2>\n\t\t<p class=\"wprm-fallback-recipe-summary\">\n\t\t<p>Using this method of cooking a turkey is the perfect way to ensure an ill-timed meal on Thanksgiving. Even so, it&#x27;s the only method I&#x27;m allowed to use at our house.</p>\t</p>\n\t<div class=\"wprm-fallback-recipe-ingredients\">\n\t\t<ul><li>1 turkey ( any size will do, try not to get one that&#x27;s been brined as this will change the flavor a little)</li><li>5 limes</li><li>4 sprigs fresh rosemary</li></ul>\t</div>\n\t<div class=\"wprm-fallback-recipe-instructions\">\n\t\t<ol><li><p>Make sure the turkey is defrosted before you start. This absolutely won&#x27;t work with a partially frozen turkey. Estimate 30 minutes in the fridge for every pound of turkey (e.g. 8 hours for a 16 lb bird).</p></li><li><p>If you&#x27;re using a Weber kettle, set it up for indirect heat. For this recipe, I build two piles of 20 briquettes each on either side of the grill. Douse the piles with lighter fluid and light &#x27;em up. Let those coals cook while you prep the bird.</p></li><li><p>Unpackage the bird and rinse it off. Try to remove any left-over feathers and such. Put the neck and giblets in a bowl and set aside.</p></li><li><p>Using a very sharp chef&#x27;s knife, cut the bird in half along the breast bone. Turn it over and do the same along the spine. I like to remove the spine, but this method works just fine if you don&#x27;t. If you do remove the spine, cut into 2 or 3 pieces and put it in the bowl with the neck.</p><p>Be careful not to cut into either the breast bone or the spine as your knife will stick and you&#x27;ll end up frustrated. It does take some force to get through the ribs, so put a little weight into it, and be very aware of where your fingers are.</p></li><li><p>Trim off any loose flaps of skin around the neck and tail areas. Place those in the bowl with the neck.</p></li><li><p>Cover the neck bowl with plastic wrap and refrigerate.</p></li><li><p>Set the turkey halves bone-side down in the sink. Cut the limes into wedges, and squeeze them over the turkey halves. Make sure you get juice over the entire skin, including under the legs and wings. Tuck a few wedges under the wings and legs.</p></li><li><p>Remove the rosemary leaves from the sprigs and cover the turkey halves with them. If you have enough over, place a small sprig under each wing</p></li><li><p>If you&#x27;re using a gas or electric smoker, set it up for smoking at around 180 - 220F.  Lower will be longer and smokier. Just make sure it&#x27;s over 160F though or the bird will never cook to a safe temperature.</p><p>I put a metal bowl of water in the cooking chamber, but I only just started doing this. I think it does result in juicier meat.</p></li><li><p>If you&#x27;re using a Webber kettle, you&#x27;ll need to add 5 briquettes to each pile before you put the bird on.</p><p>Repeat this every 45 minutes or so while the bird cooks.</p></li><li><p>Put the bird on the grill/smoker and cook to an internal temperature of 160F.</p></li></ol>\t</div>\n\t<div class=\"wprm-fallback-recipe-notes\">\n\t\t\t</div>\n</div>\n<!--End WPRM Recipe-->",
  "created_at": "2019-12-01",
  "author": {
    "id": "author_2",
    "type": "Entry"
  },
  "tags": [
    {
      "id": "tag_56",
      "type": "Entry"
    },
    {
      "id": "tag_58",
      "type": "Entry"
    },
    {
      "id": "tag_57",
      "type": "Entry"
    }
  ],
  "categories": [
    {
      "id": "category_55",
      "type": "Entry"
    }
  ]
}