{
  "id": "post_98",
  "title": "Cowboy Beans",
  "wordpress_url": "https://recipes.ihathaway.com/side-dishes/cowboy-beans/",
  "content": "<img src=\"https://recipes.ihathaway.com/wp-content/uploads/2020/10/IMG_0022-300x225.jpeg\" alt=\"\" width=\"300\" height=\"225\">\n\nOk, we've been making these beans forever. I have totally been in love with BBQ since I was a kid. My mom tells stories of how I'd stuff myself silly on beef ribs when I was 12. Well, I don't have the eating stamina I used to have, but I do have the need to feed on smoky meat.\n\nOf course, all good BBQ requires good sides. I'm partial to corn bread, cole slaw, and beans. Problem is, I don't like sweet beans. Most folks add a ton of brown sugar to the beans, and that just ruins a good smoky meal for me. So I went searching for a different way to do pinto beans for my BBQ feasts.\n\nI found a recipe at About.com (an old web site that hired \"experts\" to write posts on topics they knew something about) that served as a great starting point. About.com isn't around anymore, but a version of that original is <a href=\"https://www.thespruceeats.com/texas-cowboy-beans-336114\">here</a> at Spruce Eats.\n\nThis recipe calls for burnt ends, which are fantastic, but I never have them around. So I just use good bacon, scraps if you can get them. The scraps can be cut into delicious little bacon bombs, about 1/2 inch cubed. If you can't get bacon scraps, just use thick slices. Trust me, it's better that way.\n\nOh, and the BBQ sauce you use makes a huge difference. I use our <a href=\"https://recipes.ihathaway.com/snacks/spicy-bbq-sauce/\">homemade spicy sauce,</a> but use whatever you like.\n\n<!--WPRM Recipe 95-->\n<div class=\"wprm-fallback-recipe\">\n\t<h2 class=\"wprm-fallback-recipe-name\">Cowboy Beans</h2>\n\t<img class=\"wprm-fallback-recipe-image\" src=\"https://recipes.ihathaway.com/wp-content/uploads/2020/10/IMG_0022-150x150.jpeg\"/>\t<p class=\"wprm-fallback-recipe-summary\">\n\t\t<p>A BBQ-based pinto bean recipe, nice and hot</p>\t</p>\n\t<div class=\"wprm-fallback-recipe-ingredients\">\n\t\t<ul><li>2 cups chopped bacon (I like to use scraps if you can find them. You get some bigger chunks that way.)</li><li>3 jalapeños sliced</li><li>1 large onion chopped</li><li>6 cloves garlic minced</li><li>1 lb dry pinto beans</li><li>8 cups water</li><li>1 cup bbq sauce (I use our home recipe)</li><li>1 tbsp chili powder</li><li>1 tbps worcestershire sauce</li><li>1 tsp ground cumin</li><li>1 tsp salt</li></ul>\t</div>\n\t<div class=\"wprm-fallback-recipe-instructions\">\n\t\t<ol><li><p>If you aren&#039;t using an Instant Pot, soak the beans for 8 hours or so prior to cooking. It&#039;s not strictly necessary, but you&#039;ll be cooking them forever if you don&#039;t.</p></li><li><p>Sauté bacon in a medium stock pot or the Instant Pot set on Sauté-medium until the fat is translucent</p></li><li><p>Add the jalapeños and cook for about 3 min.</p></li><li><p>Add the onions and cook until translucent, about 5 minutes</p></li><li><p>Add the garlic and cook for 30 seconds to a minute. You want to just start to smell it.</p></li><li><p>Add the rest of the ingredients.</p></li><li><p>If you&#039;re using an Instant Pot, cook on the default bean setting and do a quick release.  If you&#039;re using a stock pot, just simmer until you can&#039;t stand it anymore, at least 2 hours.</p></li></ol>\t</div>\n\t<div class=\"wprm-fallback-recipe-notes\">\n\t\t\t</div>\n</div>\n<!--End WPRM Recipe-->",
  "created_at": "2020-10-18",
  "author": {
    "id": "author_2",
    "type": "Entry"
  },
  "tags": [
    {
      "id": "tag_114",
      "type": "Entry"
    },
    {
      "id": "tag_113",
      "type": "Entry"
    },
    {
      "id": "tag_112",
      "type": "Entry"
    },
    {
      "id": "tag_115",
      "type": "Entry"
    }
  ],
  "categories": [
    {
      "id": "category_116",
      "type": "Entry"
    }
  ]
}